#include <iostream>

using namespace std;
//---------------------Функции и Прототипы---------------------------------------





//------------------------MAIN----------------------------------------------------
int main() {
	setlocale(LC_ALL, "RU");
	
	//-------------------------------САМА ПРОГА-------------------------------------

	double x;

	cout << "Введите число: ";
	cin >> x;

	if (x == (int)x)
	{
		cout << "число целое" << endl;
	}
	else
	{
		cout << "число вещественное" << endl;
	}




	system("pause");

	return 0;
}
